; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	image2 - mode
	image1 - mode
	image0 - mode
	Star1 - direction
	GroundStation9 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	Star7 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image0)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star6)
	(supports instrument2 image2)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star7)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(supports instrument5 image2)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument6 image2)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation10)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 image1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star2)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 image0)
	(supports instrument8 image1)
	(calibration_target instrument8 Star7)
	(calibration_target instrument8 GroundStation8)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation9)
	(supports instrument9 image1)
	(calibration_target instrument9 Star7)
	(calibration_target instrument9 GroundStation5)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation5)
)
(:goal (and
	(pointing satellite0 GroundStation9)
	(pointing satellite1 Planet11)
	(pointing satellite4 GroundStation5)
	(have_image Planet11 image0)
	(have_image Planet12 image0)
	(have_image Star13 image2)
	(have_image Star14 image2)
	(have_image Planet15 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
2. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 2 of 8
3. (turn_to satellite0 planet15 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet15)
   goals met: 2 of 8
4. (take_image satellite0 planet15 instrument0 image0)
   added: (have_image planet15 image0)
   goals met: 3 of 8
5. (turn_to satellite0 planet12 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet12)
   goals met: 3 of 8
6. (take_image satellite0 planet12 instrument0 image0)
   added: (have_image planet12 image0)
   goals met: 4 of 8
7. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 4 of 8
8. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 5 of 8
9. (turn_to satellite0 star13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star13)
   goals met: 5 of 8
10. (take_image satellite0 star13 instrument0 image2)
   added: (have_image star13 image2)
   goals met: 6 of 8
11. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 8
12. (take_image satellite0 star14 instrument0 image2)
   added: (have_image star14 image2)
   goals met: 7 of 8
13. (turn_to satellite0 groundstation9 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation9)
   goals met: 8 of 8
